In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
#from datetime import datetime

In [13]:
df = pd.read_table("ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt", delim_whitespace=True, comment='#' , header=None)

In [14]:
df.head()

      0  1         2       3       4       5  6
0  1958  3  1958.208  315.71  315.71  314.62 -1
1  1958  4  1958.292  317.45  317.45  315.29 -1
2  1958  5  1958.375  317.50  317.50  314.71 -1
3  1958  6  1958.458  -99.99  317.10  314.85 -1
4  1958  7  1958.542  315.86  315.86  314.98 -1

In [15]:
new_df = df.loc[:,[0,1,3]]

In [16]:
new_names = ['year','month', 'decimal_date', 'average', 'interpolated', 'trend', 'days']

In [17]:
df.columns =new_names

In [18]:
df.head()

   year  month  decimal_date  average  interpolated   trend  days
0  1958      3      1958.208   315.71        315.71  314.62    -1
1  1958      4      1958.292   317.45        317.45  315.29    -1
2  1958      5      1958.375   317.50        317.50  314.71    -1
3  1958      6      1958.458   -99.99        317.10  314.85    -1
4  1958      7      1958.542   315.86        315.86  314.98    -1

### Filling up -99.99 by Na

In [19]:
df.iloc[3,2]

1958.4579999999999

In [20]:
df.shape[0]

735

In [21]:
for value in range(df.shape[0]):
     if df.iloc[value, 3] == -99.99:
            df.iloc[value, 3] = np.nan

In [24]:
df.rename(columns={'average': 'co2'}, inplace=True)

In [25]:
df['Day'] = 15

In [26]:
df.head()

   year  month  decimal_date     co2  interpolated   trend  days  Day
0  1958      3      1958.208  315.71        315.71  314.62    -1   15
1  1958      4      1958.292  317.45        317.45  315.29    -1   15
2  1958      5      1958.375  317.50        317.50  314.71    -1   15
3  1958      6      1958.458     NaN        317.10  314.85    -1   15
4  1958      7      1958.542  315.86        315.86  314.98    -1   15

In [27]:
df['date'] = pd.to_datetime((df[['year', 'month', 'Day']]).apply(lambda x: \
                                                                 '-'.join([str(x['year']), str(x['month']), \
                                                                            str(x['Day'])]), axis = 1))

In [28]:
df.head()

,year,month,decimal_date,co2,interpolated,trend,days,Day,date
0,1958,3,1958.208,315.71,315.71,314.62,-1,15,1958-03-15
1,1958,4,1958.292,317.45,317.45,315.29,-1,15,1958-04-15
2,1958,5,1958.375,317.50,317.50,314.71,-1,15,1958-05-15
3,1958,6,1958.458,NaN,317.10,314.85,-1,15,1958-06-15
4,1958,7,1958.542,315.86,315.86,314.98,-1,15,1958-07-15

In [29]:
df.drop('Day', axis = 1).head()

   year  month  decimal_date     co2  interpolated   trend  days       date
0  1958      3      1958.208  315.71        315.71  314.62    -1 1958-03-15
1  1958      4      1958.292  317.45        317.45  315.29    -1 1958-04-15
2  1958      5      1958.375  317.50        317.50  314.71    -1 1958-05-15
3  1958      6      1958.458     NaN        317.10  314.85    -1 1958-06-15
4  1958      7      1958.542  315.86        315.86  314.98    -1 1958-07-15

In [32]:
df.groupby('year')['co2'].mean().head()

year
1958    315.331250
1959    315.974167
1960    316.907500
1961    317.637500
1962    318.450833
Name: co2, dtype: float64

### 10

In [31]:
df.iloc[ list(np.where(df.iloc[:,3]==-99.99))[0],3 ]=np.nan